app/controllers/products_controller.rb

SELECT  `products`.* FROM `products`  ORDER BY id asc LIMIT 20
---
  def index
    @products = Product.order('id' 'asc').limit 20

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def show
    @product = Product.find params[:id]

SELECT `products`.* FROM `products` WHERE (title LIKE('%%'))
---
  def search
    @products = Product.where('title LIKE(?)', "%#{params[:keyword]}%")