app/controllers/reviews_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def new
    @products = Product.find params[:product_id]

INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('aa', 1, 'aaa', 1, '2015-10-20 10:32:47', '2015-10-20 10:32:47')
---
  def create
    Review.create(create_params)